<?php
require_once("../lib/selida.php");
?>
<title>FAQ</title>
<?php
Selida::head();
Selida::stylesheet("bbska");
Selida::stylesheet("help/help");
Selida::javascript("help/help");
Selida::body();
Selida::toolbar();
Selida::ofelimo_open();
?>

<div class="erotisi">
<h3>Πώς τροποποιώ το περιεχόμενο μιας πληροφοριακής μονάδας;</h3>

<p>
Για να τροποποιήσει κανείς το περιεχόμενο μιας πληροφοριακής μονάδας,
θα πρέπει να κάνει επώνυμη χρήση και να είναι ο δημιουργός της μονάδας.
Θα πρέπει, ακόμη, η σελίδα να βρίσκεται σε update mode, δηλαδή ο χρήστης
θα πρέπει να έχει κάνει κλικ στο εικονίδιο με το σφυρί και το γαλλικό
κλειδί, στο αριστερό μέρος της σελίδας.
</p>

<p>
Εφόσον πληρούνται οι παραπάνω προϋποθέσεις, ο χρήστης μπορεί να κάνει κλικ
στην επικεφαλίδα της πληροφοριακής μονάδας και κατόπιν κλικ στο πλήκτρο [Edit],
προκειμένου να τοποποιήσει την πληροφορία που περιέχεται στη μονάδα.
Μπορεί, ακόμη, να κάνει διπλό κλικ στην επικεφαλίδα της πληροφοριακής μονάδας.
Η μεταβολή της πληροφορίας γίνεται μέσω φόρμας στην οποία ο χρήστης μπορεί
να προσθέσει πεδία, να διαγράψει πεδία, ή να τροποποιήσει τα υπάρχοντα πεδία.
Αφού γίνουν οι απαραίτητες τροποιήσεις, ο χρήστης κάνει κλικ στο πλήκτρο
save προκειμένου να αποθηκευτούν οι αλλαγές.
</p>
</div>

<div class="erotisi">
<h3>Πώς μετακινώ μια πληροφοριακή μονάδα;</h3>

<p>
Για να μετακινήσει κανείς μια πληροφοριακή μονάδα από μια θέση σε κάποια
άλλη θέση,
θα πρέπει να κάνει επώνυμη χρήση και να είναι ο δημιουργός της μονάδας.
Θα πρέπει, ακόμη, η σελίδα να βρίσκεται σε update mode, δηλαδή ο χρήστης
θα πρέπει να έχει κάνει κλικ στο εικονίδιο με το σφυρί και το γαλλικό
κλειδί, στο αριστερό μέρος της σελίδας.
</p>

<p>
Εφόσον πληρούνται οι παραπάνω προϋποθέσεις, ο χρήστης μπορεί να κάνει κλικ
στην επικεφαλίδα της πληροφοριακής μονάδας την οποία επιθυμεί να μετακινήσει
και κατόπιν κλικ στο πλήκτρο [Cut],
προκειμένου να αποκόψει τη συγκεκριμένη πληροφοριακή μονάδα από τον τρέχοντα κόμβο.
Κατόπιν, ο χρήστης, θα πρέπει να μεταβεί στον κόμβο αφίξεως και εκεί να κάνει
κλικ στο πλήκτρο [Put]. Αυτό θα έχει ως αποτέλεσμα να μετακινηθεί η πληροφοριακή
μονάδα, ως πρώτη υπομονάδα τον κόμβο προορισμού.
</p>

<p>
Αν ο χρήστης επιθυμεί να μεταφέρει την πληροφοριακή μονάδα σε κάποιο άλλο
σημείο του κόμβου και όχι στην αρχή, τότε θα πρέπει να επιλέξει τον
κόμβο δίπλα στον οποίο επιθυμεί να μετακινήσει &ndash;ως sibling&ndash;
την πληροφοριακή μονάδα και, αφού ανοίξει το σχετικό panel,
να κάνει κλικ στο πλήκτρο [Paste].
</p>
</div>

<div class="erotisi">
<h3>Πώς διαγράφω μια πληροφοριακή μονάδα;</h3>

<p>
Για να διαγράψει κανείς μια πληροφοριακή μονάδα
θα πρέπει να κάνει επώνυμη χρήση και να είναι ο δημιουργός της μονάδας.
Θα πρέπει, ακόμη, η σελίδα να βρίσκεται σε update mode, δηλαδή ο χρήστης
θα πρέπει να έχει κάνει κλικ στο εικονίδιο με το σφυρί και το γαλλικό
κλειδί, στο αριστερό μέρος της σελίδας.
</p>

<p>
Εφόσον πληρούνται οι παραπάνω προϋποθέσεις, ο χρήστης μπορεί να κάνει κλικ
στην επικεφαλίδα της πληροφοριακής μονάδας την οποία επιθυμεί να διαγράψει
και κατόπιν κλικ στο πλήκτρο [Delete].
Θα εμφανιστεί τότε panel επιβεβαίωσης της διαγραφής και ο χρήστης θα πρέπει
να κάνει εκ νέου κλικ στο πλήκτρο [Delete], η να ακυρώσει τη διαγραφή.
</p>
</div>

<div class="erotisi">
<h3>Πώς μπορώ να εμφανίσω στη σελίδα κάποιον συγκεκριμένο κόμβο;</h3>

<p>
Για να εμφανίσει κανείς στη σελίδα της bbska κάποιον συγκεκριμένο κόμβο,
αρκεί να καθορίσει στο URL τον αριθμό του κόμβου με την παράμετρο root,
αν π.χ. θέλουμε να εμφανίσουμε τον κόμβο με κωδικό αριθμό 18223, δίνουμε στο URL:
<span class="code">www.bbska.info?root=18223</span>
και εφόσον ο χρήστης έχει πρόσβαση στον συγκεκριμένο κόμβο, είτε ως δημιουργός,
είτε επειδή ο κόμβος είναι δημόσιος, θα εμφανιστεί στη σελίδα ο κόμβος αυτός.
</p>
</div>

<div class="erotisi">
<h3>Γιατί κάποιες μονάδες έχουν διπλό περίγραμμα;</h3>

<p>
Οι πληροφοριακές μονάδες που έχουν διπλό περίγραμμα είναι «εκρηκτικές», τουτέστιν
αναπτύσσονται αυτόματα σε όλο το βάθος τους όποτε χρησιμοποιηθούν ως αρχικές
μονάδες της σελίδας. Αυτό επιτυγχάνεται με την εισαγωγή της ιδιότητας
<span class="typo">_explode_</span class="typo">
χωρίς περιεχόμενο.
</p>
</div>

<div class="erotisi">
<h3>Πώς μπορώ να «μπλοκάρω» την ανάπτυξη εκρηκτικών μονάδων σε συγκεκριμένες υπομονάδες;</h3>

<p>
Μπορούμε να εντάξουμε την ιδιότητα
<span class="typo">_neutral_</span class="typo">
χωρίς περιεχόμενο σε υπομονάδες εκρηκτικών μονάδων προκειμένου να «μπλοκάρουμε»
την περαιτέρω ανάπτυξη των εκρηκτικών μονάδων στις συγκεκριμένες υπομονάδες.
Οι υπομονάδες αυτές μπορούν, ωστόσο, να είναι οι ίδιες εκρηκτικές,
πράγμα που σημαίνει ότι αν ανοιχτούν ως ριζικές μονάδες θα ανοίξουν εκρηκτικά.
</p>

<p>
Παρεμεφερής είναι η ιδιότητα
<span class="typo">_block_</span class="typo">
(χωρίς περιεχόμενο) σε υπομονάδες εκρηκτικών μονάδων.
Οι μονάδες αυτές παρέχονται από τον server χωρίς υπομονάδες,
εκτός και αν χρησιμοποιούνται ως ριζικές.
Με αυτόν τον τρόπο μπορούμε να κάνουμε «οικονομία» σε πόρους φροντίζοντας
να «μπλοκάρουμε» αυτόνομες μονάδες και υπομονάδες.
</p>
</div>

<div class="erotisi">
<h3>Πώς μπορώ να αλλάξω τον τίτλο στην καρτέλα του φυλλομετρητή;</h3>

<p>
Ο τίτλος στην καρτέλλα του φυλλομετρητή μπορεί να αλλάξει εφόσον προσθέσουμε ιδιότητα
<span class="typo">_title_</span class="typo">
με περιεχόμενο τον επιθυμητό τίτλο στη ριζική μονάδα πληροφορίας.
</p>
</div>

<div class="erotisi">
<h3>Με ποιόν τρόπο καθορίζουμε το χρώμα ή τη γραμματοσειρά της πληροφορίας;</h3>

<p>
Η αλλαγή του χρώματος ή της γραμματοσειράς μπορεί να επιτευχθεί εγκυβωτίζοντας το
επίμαχο κείμενο σε διπλές αγκύλες, π.χ. η πληροφορία
<span class="typo">[[*bbska]]</span>
θα εμφανιστεί ως
<span class="attrEntono attrEntonoWarning">bbska</span> (έντονο), η πληροφορία
<span class="typo">[[#bbska]]</span>
θα εμφανιστεί ως
<span class="attrEntono attrEntonoNotice">bbska</span> (σημείωση), η πληροφορία
<span class="typo">[[~bbska]]</span>
θα εμφανιστεί ως
<span class="attrEntono attrEntonoTrivial">bbska</span> (επισήμανση), η πληροφορία
<span class="typo">[[!bbska]]</span>
θα εμφανιστεί ως
<span class="attrEntono attrEntonoError">bbska</span> (υπόδειξη) και η πληροφορία
<span class="typo">[[@bbska]]</span>
θα εμφανιστεί ως
<span class="attrEntono attrEntonoMono">bbska</span> (γραφομηχανή).
</p>
</div>

<div class="erotisi">
<h3>Μπορώ να ταξινομήσω τις πληροφοριακές μονάδες;</h3>

<p>
Για να ταξινομήσετε τις πληροφοριακές μονάδες κάποιου κόμβου, αρκεί να προσθέσετε
στις μονάδες αυτές ειδικό attribute
<span class="typo">_sort_</span class="typo">
με τιμή κάποιο κλειδί ταξινόμησης.
Το κλειδί ταξινόμησης θα εμφανίζεται στο επάνω αριστερό μέρος κάθε πληροφοριακής
μονάδας.
Αν θέλετε το κλειδί ταξινόμησης να είναι κρυφό, μπορείτε να χρισιμοποιήσετε το attribute
<span class="typo">_tros_</span class="typo">.
</p>
</div>

<?php
Selida::ofelimo_close();
Selida::telos();
?>
