<?php
require_once("../lib/selida.php");
?>
<title>Help</title>
<?php
Selida::head();
Selida::stylesheet("help/help");
Selida::javascript("help/help");
Selida::body();
Selida::toolbar();
Selida::ofelimo_open();
?>

<div class="erotisi">
<h3>Εισαγωγή</h3>

<p>
Η σελίδα bbska μπορεί να προβάλει πληροφορία οργανωμένη εν είδει μπάμπουσκας, ήτοι
σε μονάδες πληροφορίας οι οποίες περιέχουν άλλες μονάδες πληροφορίας, οι οποίες με
τη σειρά τους μπορούν να περιέχουν άλλες μονάδες πληροφορίας κοκ.
Με άλλα λόγια, οι πληροφορίες που διαχειριζόμαστε με την bbska είναι οργανωμένες
με τον τρόπο που οι μπάμπουσκες, οι γνωστές ξύλινες ρωσικές κούκλες, είναι
τοποθετημένες η κάθε μια μέσα σε μια μεγαλύτερη κούκλα κοκ.
Κάθε μονάδα πληροφορίας φέρει έναν κωδικό αριθμό και στοιχεία της μορφής key/value.
Οι μονάδες πληροφορίας ονομάζονται και κόμβοι και κάθε κόμβος μπορεί να είναι
δημόσιος ή ιδιωτικός.
</p>
</div>

<div class="erotisi">
<h3>Εγγραφή χρήστη</h3>

<p>
Η χρήση της bbska μπορεί να είναι είτε ανώνυμη, είτε επώνυμη.
Προκειμένου να γίνει επώνυμη χρήση της σελίδας θα πρέπει ο χρήστης να πραγματοποιήσει
εγγραφή καταχωρώντας τα στοιχεία του στη σχετική σελίδα εγγραφής (signup).
Τα στοιχεία που καταχωρεί ο χρήστης είναι κάποιο login name της επιλογής του,
το ονοματεπώνυμό του, το email του και κάποιος κωδικός τον οποίο θα πρέπει να
γνωρίζει μόνον ο ίδιος.
Από αυτά τα στοιχεία, το μόνο που υποχρεωτικό είναι το login name,
ενώ κατά τη διαδικασία της εγγραφής το πρόγραμμα θα ζητήσει από τον χρήστη
να συμπληρώσει το αποτέλεσμα μιας απλής αριθμητικής πράξης προκειμένου
να αποδείξει ότι δεν είναι ρομπότ.
</p>

<p>
Αμέσως μετά την εγγραφή του, ο χρήστης θα εισέλθει επωνύμως στη βασική σελίδα
τής bbska, όπου μπορεί να καταχωρήσει μονάδες πληροφορίας κάτω από τον βασικό
κόμβο τού χρήστη, κόμβο που έχει ήδη δημιουργήσει αυτόματα το πρόγραμμα κατά την εγγραφή.
Για να δημιουργήσει ο χρήστης νέα πληροφοριακή μονάδα, ή για να κάνει εν γένει
οποιαδήποτε μεταβολή στις πληροφορίες που καταχωρεί και διαχειρίζεται, θα πρέπει
να κάνει κλικ στο εικονίδιο με το σφυρί και το γαλλικό κλειδί που εμφανίζεται
στο αριστερό μέρος της σελίδας.
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο η σελίδα τίθεται σε update mode,
πράγμα που σημαίνει ακριβώς αυτό, ότι δηλαδή ο χρήστης έχει δικαίωμα να
καταχωρήσει νέες πληροφορίες, ή να τροποποιήσει τις υπάρχουσες πληροφορίες
κατά οποιονδήποτε τρόπο.
</p>
</div>

<div class="erotisi">
<h3>Εισαγωγή νέας πληροφοριακής μονάδας</h3>

<p>
Προκειμένου ο χρήστης να καταχωρήσει νέα πληροφοριακή μονάδα στο σύστημα, θα πρέπει
κάνει κλικ στην επικεφαλίδα μιας υπάρχουσας πληροφοριακής μονάδας στη σελίδα.
Κάνοντας κλικ στη επικεφαλίδα οποιουδήποτε κόμβου, εμφανίζεται panel πλήκτρων
με τα οποία ο χρήστης μπορεί να επιτελέσει διάφορες ενέργειες, π.χ. append,
edit, link, delete κλπ.
Το πλήκτρο append είναι αυτό που επιτρέπει στον χρήστη να προσθέσει νέα
πληροφοριακή μονάδα «κάτω» από μια υπάρχουσα πληροφοριακή μονάδα.
Με τον όρο «κάτω» εννοούμε ότι η νέα πληροφοριακή μονάδα θα ενταχθεί ως υπομονάδα
στην υπάρχουσα πληροφοριακή μονάδα.
</p>

<p>
Ο χρήστης μπορεί να δημιουργήσει νέα πληροφοριακή μονάδα και με άλλους τρόπους.
Ένας από αυτούς είναι να πατήσει το πλήκτρο new με το οποίο δημιουργείται
νέα πληροφοριακή μονάδα στο ίδιο επίπεδο με την υπάρχουσα πληροφοριακή μονάδα
(sibling). Παρόμοια λειτουργία έχει και το πλήκτρο clone με το οποίο ο χρήστης
μπορεί να δημιουργήσει νέα πληροφοριακή μονάδα ως ακριβές αντίγραφο μιας
υπάρχουσας πληροφοριακής μονάδας και κατόπιν να την τροποποιήσει.
</p>
</div>

<div class="erotisi">
<h3>Ξεδίπλωμα πληροφοριακής μονάδας</h3>

<p>
Εφόσον κάποια πληροφοριακή μονάδα περιέχει επιμέρους πληροφοριακές μονάδες,
παρέχεται η δυνατότητα εμφάνισης των επιμέρους κόμβων της μονάδας,
μέσω κλικ στο εικονίδιο της μπάμπουσκας που εμφανίζεται
στο επάνω αριστερά μέρος του σχετικού κόμβου.
Κάνοντας κλικ στην μπάμπουσκα οποιουδήποτε κόμβου, ο κόμβος αναπτύσσεται
στη σελίδα και εμφανίζονται &ndash;με κάποια εσοχή&ndash; οι επιμέρους κόμβοι της
πατρικής πληροφοριακής μονάδας.
</p>

<p>
Σε μια ανεπτυγμένη πληροφοριακή μονάδα η μπάμπουσκα εμφανίζεται αχνή και αντεστραμμένη.
Για να «κλείσουμε» μια ανεπτυγμένη πληροφοριακή μονάδα, κάνουμε κλικ στην
(ανεστραμμένη) μπάμπουσκα του σχετικού κόμβου. Όταν «κλείνουμε» κάποια
πληροφοριακή μονάδα, «κλείνουν» και όλες οι τυχόν ανεπτυγμένες υπομονάδες
που ίσως έχουμε ξεδιπλώσει κάτω από την πατρική πληροφοριακή μονάδα.
</p>
</div>

<div class="erotisi">
<h3>Επεξεργασία πληροφοριακής μονάδας</h3>

<p>
Πριν προβούμε σε οποιαδήποτε ενέργεια επεξεργασίας θα πρέπει να φροντίσουμε
ώστε η σελίδα να βρίσκεται σε update mode. Για να περιέλθει η σελίδα σε
update mode, αρκεί να κάνουμε κλικ στο εικονίδιο με το σφυρί και το γαλλικό
κλειδί που βρίσκεται στο αριστερό μέρος της σελίδας.
Εφόσον η σελίδα βρίσκεται σε update mode μπορούμε να προβούμε σε επεξεργασία
οποιασδήποτε πληροφοριακής μονάδας, εφόσον έχουμε φυσικά την κυριότητα της
μονάδας.
</p>

<p>
Για να επεξεργαστούμε καθ' οιονδήποτε τρόπο μια πληροφοριακή μονάδα,
κάνουμε κλικ στην επικεφαλίδα της συγκεκριμένης μονάδας.
Επικεφαλίδα μιας πληροφοριακής μονάδας είναι η περιοχή στο επάνω μέρος της
μονάδας, δηλαδή η περιοχή όπου βρίσκεται ο κωδικός της μονάδας.
Μπορούμε να κάνουμε κλικ και σε οποιαδήποτε άλλη περιοχή της μονάδας εκτός
του ωφέλιμου χώρου, όπου ωφέλιμος χώρος μιας πληροφοριακής μονάδας ορίζεται
ο χώρος στον οποίον εμφανίζονται αυτές καθαυτές οι πληροφορίες που περιέχονται
στη μονάδα με τη μορφή key/value pair.
</p>
</div>

<div class="erotisi">
<h3>Εισαγωγή [Append]</h3>

<p>
Ένας απλός και συνήθης τρόπος για να δημιουργήσουμε μια νέα μονάδα πληροφορίας
είναι μέσω του πλήκτρου [Append]. Κάνοντας κλικ στο εν λόγω πλήκτρο, δημιουργείται
νέα, κενή πληροφοριακή μονάδα και εντάσσεται ως υπομονάδα «κάτω» από τη μονάδα
στην οποία κάναμε append. Αμέσως μετά τη δηιουργία της νέας μονάδας, το πρόγραμμα
μάς περνά σε φόρμα ενημέρωσης της νεόκοπης μονάδας, όπου ο χρήστης μπορεί να
καταχωρήσει πληροφορίες στην εν λόγω μονάδα ως key/value pairs (βλέπε edit).
</p>
</div>

<div class="erotisi">
<h3>Ενημέρωση [Edit]</h3>

<p>
Με το πλήκτρο [Edit] μπορούμε να τροποιήσουμε αυτές καθαυτές τις πληροφορίες
του αντίστοιχου κόμβου. Οι πληροφορίες μιας πληροφοριακής μονάδας καταχωρούνται
ως key/value pairs και δημιουργούν την εικόνα πίνακα με δύο στήλες. Μέσω
διαφόρων τεχνασμάτων μπορούμε να παραλλάξουμε κάπως τη συγκεκριμένη δομή,
αλλά σε γενικές γραμμές οι πληροφορίες κάθε κόμβου είναι δομημένες με τον
τρόπο που περιγράψαμε παραπάνω.
</p>
</div>

<div class="erotisi">
<h3>Ιδιωτικότητα</h3>

<p>
Εκτός από τα key/value pairs, κάθε πληροφοριακή μονάδα χαρακτηρίζεται από
ένα καθεστώς ιδιωτικότητας στο οποίο ο δημιουργός της μονάδας μπορεί να
καθορίσει αν η συγκεκριμένη μονάδα είναι δημόσια προσβάσιμη ή όχι.
Μια δημόσια προσβάσιμη πληροφοριακή μονάδα είναι ακριβώς αυτό, είναι
δηλαδή δημόσια προσβάσιμη πράγμα που σημαίνει ότι οποιοσδήποτε γνωρίζει
τον κωδικό αριθμό του αντίστοιχου κόμβου μπορεί να προσπελάσει τη συγκεκριμένη
μονάδα είτε με επώνυμη, είτε με ανώνυμη χρήση της σελίδας.
</p>

<p>
Για να προσπελάσει κανείς κάποιον κόμβο μέσω του bbska, αρκεί να καθορίσει
ως root τον αριθμό του κόμβο στο URL, αν π.χ. θέλουμε να προσπελάσουμε τον
κόμβο με κωδικό αριθμό 18223, δίνουμε στο URL:
<span class="code">www.bbska.info?root=18223</span>
και εφόσον ο χρήστης έχει πρόσβαση στον συγκεκριμένο κόμβο, είτε ως δημιουργός,
είτε επειδή ο κόμβος είναι δημόσιος, θα εμφανιστεί στη σελίδα ο κόμβος αυτός.
</p>

<p>
Αντίθετα, μια μονάδα που χαρακτηρίζεται ιδιωτική δεν είναι προσβάσιμη
με ανώνυμη χρήση, ούτε με επώνυμη χρήση από άλλον χρήστη πλην του
δημιουργού της μονάδας. Αν, π.χ. κάποια πληροφοριακή μονάδα περιέχει
ευαίσθητα προσωπικά δεδομένα, τότε αυτή η μονάδα θα πρέπει να χαρακτηριστεί ως
ιδιωτική, καθώς εαν χαρακτηριστεί δημόσια, θα είναι προσβάσιμη από
οποιονδήποτε χρήστη της σελίδας σε όλο τον κόσμο.
</p>

<p>
Το πρόγραμμα φροντίζει ώστε μια πληροφοριακή μονάδα που δημιουργείται
ως υπομονάδα κάποιας ιδιωτικής μονάδας, να χαρακτηρίζεται αρχικά ως
ιδιωτική, ο χρήστης όμως μπορεί να αλλάξει αυτό το καθεστώς, προσέχοντας
βέβαια στις νέες υπομονάδες να αλλάξει και πάλι το καθεστώς εφόσον αυτό
είναι ιδιωτικό.
</p>
</div>

<div class="erotisi">
<h3>Νέα μονάδα [New]</h3>

<p>
Με το πλήκτρο [New] μπορούμε να δημιουργήσουμε νέα πληροφοριακή μονάδα
ως sibling πλάι στη μονάδα στην οποία επιχειρούμε την εν λόγω ενέργεια.
Η μονάδα δημιουργείται κενή και το πρόγραμμα μας περνά αυτόματα στη
φόρμα τροποποίησης πληροφοριακής μονάδας, όπου μπορούμε να καταχωρήσουμε
τις πληροφορίες της μονάδας ως key/value pairs και να καθορίσουμε την
ιδιωτικότητα της νέας μονάδας.
</p>
</div>

<div class="erotisi">
<h3>Κλωνισμός [Clone]</h3>

<p>
Με το πλήκτρο [Clone] δημιουργείται νέα πληροφοριακή μονάδα ως ακριβές
αντίγραφο της μονάδας στην οποία επιχειρούμε την εν λόγω ενέργεια.
Η μονάδα δημιουργείται ως sibling πλάι στη μονάδα στην οποία επιχειρούμε
τον κλωνισμό. Αμέσως μετά, το πρόγραμμα μας περνά αυτόματα στη
φόρμα τροποποίησης πληροφοριακής μονάδας, όπου μπορούμε να τροποποιήσουμε
τις πληροφορίες της μονάδας ως key/value pairs και να καθορίσουμε την
ιδιωτικότητα της νέας μονάδας.
</p>
</div>

<div class="erotisi">
<h3>Καλάθι</h3>

<p>
Για κάθε χρήστη παρέχεται ένας ιδιαίτερος κόμβος που ονομάζεται «καλάθι»
του χρήστη και ο οποίος χρησιμοποιείται ως προσωρινός αποθηκευτικός χώρος
προκειμένου να κρατηθούν εκεί μονάδες πληροφορίας τις οποίες ο χρήστης
επιλέγει να συνδέσει ή να μετακινήσει από μια πληροφοριακή μονάδα σε άλλη.
Πιο συγκεκριμένα, το καλάθι του χρήστη χρησιμοποιείται κατά την αποκοπή,
τη σύνδεση, την επικόλληση και την απόθεση.
</p>
</div>

<div class="erotisi">
<h3>Αποκοπή [Cut]</h3>

<p>
Οποιαδήποτε πληροφοριακή μονάδα, μπορεί να αποκοπεί από τη μονάδα στην οποία ανήκει
ως υπομονάδα και να μεταφερθεί ως υπομονάδα σε άλλη πατρική πληροφοριακή μονάδα με
χρήση του πλήκτρου [Cut]. Κάνοντας κλικ στο εν λόγω πλήκτρο, η αντίστοιχη μονάδα
πληροφορίας μεταφέρεται στο «καλάθι» του χρήστη, όπου πιθανόν να υπάρχουν και άλλες
πληροφοριακές μονάδες. Κατόπιν ο χρήστης μπορεί να κάνει επικόλληση, ή απόθεση που
σημαίνει ότι οι πληροφοριακές μονάδες από το καλάθι του χρήστη θα επικολληθούν,
ή θα αποτεθούν σε άλλη πατρική πληροφοριακή μονάδα.
</p>
</div>

<div class="erotisi">
<h3>Σύνδεση [Link]</h3>

<p>
Πατώντας το πλήκτρο [Link] σε κάποια πληροφοριακή μονάδα, η μονάδα αυτή τοποθετείται
στο «καλάθι» του χρήστη, χωρίς όμως να αποκόπτεται από την τρέχουσα θέση στην οποία
βρίσκεται. Κατόπιν μπορούμε να κάνουμε επικόλληση, ή απόθεση με σκοπό να δημιουργήσουμε
νέα τοποθεσία στην οποία μπορεί να βρεθεί η συγκεκριμένη πληροφοριακή μονάδα.
Με άλλα λόγια, με χρήση του πλήκτρου [Link] μπορούμε να «μαρκάρουμε» πληροφοριακές
μονάδες τις οποίες επιθυμούμε να προσπελαύνουμε και μέσω άλλω πατρικών μονάδων.
</p>
</div>

<div class="erotisi">
<h3>Απόθεση [Put]</h3>

<p>
Με την απόθεση, οι μονάδες πληροφορίας ή οι συνδέσεις που βρίσκονται στο «καλάθι»
του χρήστη, τοποθετούνται ως υπομονάδες στη μονάδα στην οποία γίνεται η απόθεση.
Οι μονάδες τοποθετούνται πρώτες στη σειρά κάτω από τη νέα πατρική μονάδα.
Αν επιθυμούμε να τις τοποθετήσουμε σε κάποιο άλλο σημείο μέσα στην πατρική μονάδα,
τότε μπορούμε να κάνουμε επικόλληση (paste) στην υπομονάδα πλάι στην οποία επιθυμούμε
να τοποθετήσουμε τις μονάδες αυτές ως siblings.
</p>
</div>

<div class="erotisi">
<h3>Επικόλληση [Paste]</h3>

<p>
Πατώντας το πλήκτρο [Paste] σε κάποια πληροφοριακή μονάδα, οι πληροφοριακές
μονάδες που έχουν τοποθετηθεί στο «καλάθι» του χρήστη επικολλούνται ως siblings
πλάι στη μονάδα στην οποία επιχειρούμε την επικόλληση.
</p>
</div>

<div class="erotisi">
<h3>Διαγραφή [Delete]</h3>

<p>
Η διαγραφή πληροφοριακής μονάδας αποκόπτει τη συγκεκριμένη μονάδα από την
πατρική της. Αν η σύνδεση αυτή ήταν και η τελευταία της συγκεκριμένης
πληροφοριακής μονάδας, τότε διαγράφεται και η ίδια η μονάδα από το σύστημα
και δεν υπάρχει τρόπος να ανακτηθεί.
</p>
</div>

<?php
Selida::ofelimo_close();
Selida::telos();
?>
